Revit.Elements.Group.InternalGroup
An internal handle on the Revit group

Revit.Elements.Group.InternalElement
Reference to the Element

Revit.Elements.Group.#ctor(Autodesk.Revit.DB.Group)
Private constructor

Revit.Elements.Group.InitGroup(Autodesk.Revit.DB.Group)
Initialize a group element

Revit.Elements.Group.ByElements(System.Collections.Generic.List{Revit.Elements.Element})
Creates a new type of group, with all of the input elements.
elements: Revit elements to group.
Returns: The new group type

Revit.Elements.Group.PlaceInstance(Autodesk.DesignScript.Geometry.Point,Revit.Elements.Element)
Place an instance of a Model Group into the Autodesk Revit document, using a location and a group type.
location: The point to place the group.
groupType: The type of group to place.
Returns: The new group instance.

Revit.Elements.Group.Location
Get the groups physical location whitin the project.

Revit.Elements.Group.GroupType
Get the group type.

Revit.Elements.Group.IsAttached
Indicates wether or not this group is attached to a parent group.

Revit.Elements.Group.AttachedDetailGroup
Returns the attached detail groups available for this group.

Revit.Elements.Group.GetMembers
Retrieves all the element of the group.
Returns:

Revit.Elements.Group.UngroupElements
Ungroups the group.
Returns:

Revit.Elements.Group.FromExisting(Autodesk.Revit.DB.Group,System.Boolean)
Create a Group from a user selected Element.
group:
isRevitOwned:
Returns: